#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "621b8a22ec9502bb4308aa8ec187704d" -> "8d4059ec6baa5528bb499c8060528e21"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "5424093d114a1a5d256aaa1aa1c48221" -> "1e7509203eac636cc00906bc0af8f1fd"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "d37aa28fe10affd6597048d430422763" -> "3b88479940ddb09c1439811087a486af"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "95b1e1b805a9c699b72a3f96c1657769" -> "1ba385f95e0c74bbca0aaaacfb950841"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "52ea4ad2bdb38ac270f2b9db27be43f3" -> "6766d158efa96e02f7d7853e21451509"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "52a4ae73d7056dc89ba46ffd723eba0c" -> "46f21b04463c0559fcd9a9a2b11bc239"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "f60874f6fbc7fd96efdd174d3f58d8b8" -> "2ce6614ca57db4ceb4424e5bf2aabc99"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "2696d37ef32054ea5dca9cf2839603ae" -> "a0b7137c153b641f73f56e7df6850f2d"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "f64866a7b0c8f36b07cd710b6e3ebd32" -> "1aa019b096e45803f91058d63dcea4a3"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "19d33956a961cf121d92755cc1123df9" -> "5210827b4b32a9df1c766249122b3265"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "c1eb43fac0e4d5c11835e7995bdc3328" -> "4b6a0c753185ddb2ce18bd061cc2b4aa"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "b4aa1bdc1adb4e38cfe1f8e3e7976cad" -> "033a226d5fd9789171acb647ebafe417"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "cdb566769a31d6a0e0fc54ee9a223245" -> "23b5da12c3fdbe11c6a41525187918ea"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "3182ffc9db3cb7f7879fca101d13f0b7" -> "622fe52e8dc4624f11190036051de60c"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "b1a71d40862a9aa73be8e44bf8053702" -> "c7abe0003671cf738d58fc619eb6c6e3"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "1b901c5086720d3cda501ff3adda2787" -> "3343ee69e54283f4b7c97924ae8504e1"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "a115b7d0744cb59e243d4fb76ea0d2ec" -> "488dca250c98b14e0f6e14eae8fa82f2"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "0e63ad05f17c3fea424be61a0b65c102" -> "29a40d461529c70738cb3522ba44bc4d"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "dbb8b31252926908707ba281e89946af" -> "24211212919989d6ca1220f2ef334e6b"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "44918046a528cf76bfd230b91c8571e2" -> "4d8258d4c55953c376d158c4e07aa2b5"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c2d7a0105e4edbc3397f1200ccd84160" -> "26898a19716597d7004c0da890e83345"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "93930cd5d6ca05832af6b512a1245100" -> "638725fb730852e33c292353ee2e4a76"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "e8ab3d2a8a7da8e551e02d2639547fe3" -> "ea31d9082b921d1567bc07ce10b35333"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "c2c293382343b9396d79c31cb9808b75" -> "dddc306f97e160f3943da07e58d8a24f"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "b705fd85cf6129aa5cf0b3a32cd4eb12" -> "8216c64f92078e8268787b80f07502f0"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "5b91121117d40e14f8d4638f6e9eb349" -> "a31cf47637e6eefaca8b895b6640b685"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "e38c7b45e6a6f4820b8c96ce3a3bc337" -> "0597b6b5c80d095b8785c9238b567397"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "29243f5f5843e7091cee4ec4abe371b2" -> "2e9ee31d4a8e5c63768f8d386b788b0e"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "ecd8b269323e1254e1f63a66a751b0c1" -> "0bfc79af2b67b5cafb384d389c2c1e8a"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "0b78c3de9821132b61332dadda7684c2" -> "d0457f8b9138307776a04e88d2ffbee8"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f2adf0fe95a27f563b2d8a184b4bb783" -> "26ee98d1ef50e4e9cb24201fa07b83ab"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "41d203f4cf57735aecd25dbce21b4a54" -> "608bdc42b25c13100473d5297cb2e237"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "4565ac8989d532d0caeb93af3bc65f98" -> "22d1b756e8559f2daef721c74c338312"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "dd508c6953c3e341c43d365a680947f7" -> "4fa73b5af1437120d0db19302c4d9a24"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "1ec55e77898b97bab33678f4eba44b3b" -> "c83fb2e54a877c06132da94d411b604e"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "c1b037a09f95d7949a3bb715d99563d0" -> "07e54fe42798b50e7bda121fb5c66960"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "02f8b9a079a2a071270c8423b3dea05a" -> "397f6c2d81bb99b5b885da489f5c997f"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "516996bcd57de1bad7cf6726f2734256" -> "c5f2eae7426644eae371ff37ec6f8444"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "e7a6869d52619df0360ab52e2c265c5a" -> "f025575d3064eca8adf7d164a1ddbfbe"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "da34dfa8d313cea45c25e27c368ce6e7" -> "825c7be8104613807bf3d5195830091d"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "b9f1aeb6e8a7524befa4ca2bc5c01963" -> "4131d7aac34636fcd586fe499f2b389e"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "51098d30771485c8ac65ee9710199fc6" -> "6ae667fa1e1d364a4b9a5523f93499b3"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "36e1b8285241d52c30b537d6ecfbf969" -> "c88ec289ab6e2052538e010eb1ac0808"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "GpxlRW6erNNgGyVi7nHngR54P61qX3oNrOtoZ5L0nAk=" -> "o5LloaYtH+RiTAt677d6TyG6bYHB2gNpouE+RIT/YCU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "ACaQ2iA/Uf9O8umY1avcleE/j/emfJcTMDNx5VWJT2I=" -> "gre3VweHnjcdkkFdkrSlSpSXVKdlsLW8K4BoxlbjjCM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "kM/yBDSuzXCA4kxMRxXQUBOS4X009ZvtgwuTmpBG6xg=" -> "7bRLGEUf2DZpgzmnQDKall1Q1L4Zm3rMC1f68TEeNlA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "U7ZwrPsi1rDAzHH/5O4hGKHqKKXH9+iDO5B9KknOYTk=" -> "XJ+LY14/QMj8KWtzynjSMCaFWsPf641uz0h4/WG3rzU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "CTF/G0OKeMFi6U+8WfpQh+jRG+ciJf15ETWeOk+i7XA=" -> "5JFUB/N4acBhwTFuSLJPfofdgl1FHqBfABb7FyhyXM8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "LuTKy9xT3dHmtW8ZF+u0eceVZla/ioMqowgajaBOZYc=" -> "Iz/J25A94fQX7mJn0ifJHcwL93GcadTJFOUnGTogE60="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "CKw6FT/s+ne8gXKu52AtntKlN9szJaZpZq3Tu6teU7U=" -> "LdiaBON9ko4xKx4/h9dvbopHtb9QmRgf8HMJIM7irhk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "IaeTVM6O62ehj3qpc8L/9TSibB7sAXRkkgngq0nH4BU=" -> "kzCk5jy9t2Dg3MRPZMfjMLfGoZndMoKBCY9gCXjdxYA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "aYXUc4ckpLYEsSZ5iWsdx3F7hXYUEntUYmw15po2fw8=" -> "XFpPf70rgoL8ZMWJmpS9zYxeinB5hzoF7+Vmg7+v8Mc="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "Oa/fr3Nqq6+j+F8ePTbZZygqnQ10xTRN11u7+oh8vbw=" -> "glVnCdXFaMNmE9iudVmAjfsLgjesd12EOUC4CH51ink="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "Irl/CJoO/LlAXowQ/E41y8RPjTthuAD6RWYynIWGi0U=" -> "TEZ3c5p99zuar1JGlVePl9NtRSKKkjoH6LORQ790l+0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "fCj2EXa0Y2ZeUAm51ZOOmyF9Gue9DOsv6VLdrblfv5I=" -> "A7ioFXeUaSQJptl1U4GNH4DE4wquf3OpP8pBVRAVTuY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "MCCkz5HPRlTsspYOkEVrrXtH4iSbNvhkLkUDMkB4Uh4=" -> "hQ7XLa38D+Y6IBRL1qiA/uujlvixLGHGDWq2fXgyNKE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "uFLWVgTV6MV5YuJHMx7wndJ4nfplNKvXWB4Txeqwr8g=" -> "zUoJ9LBD8yDBx/ewhsciEyNFiI+pstRaAx+2rg3zxS4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "60SCU1tadnttLvhqxwWfj36SeXRmVVlVGHjvrWgEVFU=" -> "8SOpJJPJMhdX8LQJNfu+DNHBDV/Qi8Ejw1OBdo8+CgA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "6A2A4xUnKzS4vq7bdnlcenIjr/v+/X/1ypyeZUkdOTA=" -> "kqMkIwsGFlJlrklbgYbZ0ODL5YLiUd4yilQi9ymOXlY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "CZCIVTWH6TU8VbMld8PT2K9tjUT68ddSrs93RIYq7c4=" -> "fCauGEBLCTywJwPk95DRvUBNzqHcl3EZWAIXlzBEvAQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "xqQvAZCNGviCNhhWQs+Ddt38xBftIGZNA7OQ9z7Spu0=" -> "zkNmlbYJypVOC8D+I9ndizFFrM/vf58q+hsYmPumE6A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "GwwEWm8Ax8qmSILT+YrlgoOWjLp9s66R847uc32X2wE=" -> "c2O5ItKciTC1LQxJPbKIQjyBa0g8g84IxJYOqCK0wAs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "1AmHcMetcH9+3772BRRUgNSetfqmUH8LuqPY0iZOPl4=" -> "uRzGpjD93XqtLj+80kwuAJ0zntukBO/p9yJ5EId56Cs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "znyrl9PGbiJ5nAJN6bd2OqbhaOCd7EZl86NNjDEKmRU=" -> "CPpuCeR8RiZX23VzWlNLwFuMQV7vbEuJ0WjIsvq9UTA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "V5GVH+qta6CXJFbaTAJp0v6aLPGeGtfNlIjMeRAEnMU=" -> "WU5Lh2EcfjeLakKwqnsHoMEWAV3ef/vLzB9U2IlO8gw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "q1+Nv5Wre9wCCPPQxjrNX3qFtOX6yM7EizCGfqRnAI0=" -> "+kHgdNPvHdr50Yd6Xe/XwYcWYE30Vcmj8rdRDo9aq/U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "vd0Jd0w1AVhuW7TFBYGs0m1Ws7tq3Q38uuaLFqK17js=" -> "e5A0OuwHeV2WxW7aMxlCK5oIZ7rqxWCgKZjQA1KmgUE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zj0cKzxRnr/DFc+npcDwx6UpMXq9PpdlUgAngWLk/0k=" -> "fxLT3p7t5zUJNUifQAlpu3g8kE0eYI38HEhP24cR1RI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "5/Y3dOPVPatsRc0OdRBCoLAmHw3ZdXVNtQDRMhxNPVI=" -> "yxuLt+dblAbAQ2phAwbaUoGvJT5BxVjDXhTpLPJWLUQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "GLi186NY01em5Y/mAYTNV4mcrFNMCbZJ1qOt/2+gPQg=" -> "Z/kDIP2xKjzu8967nWzyBEujaS260EIKEuC6kf4OhiI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "GbZ2EcJ7HmGxddiSvRHLSSisyf67066kyLC+aifDrD0=" -> "3C8DMvQPLWGwWdc4fkMPm3EKFzepQiItwTBphFIlYDY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "iRVuFcYztVf3ijIh/8+RS0W+2cnmVd/I8ulm2jPMxyU=" -> "B6VbRcor3JdrHpsrCsyoW+I88P9i1u4fG61YcuSyCxs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "o45RpGVmhxjSgFRJou2gS6L+ipIvDlB1ANUvsOrPI7s=" -> "gFE4VUR4ruGR/AhESPe2dftipjLusLTiqYxco3USaec="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "wKsQQRPpj2yPogI8vThZ6SqXuWAvGYdRGlGWv2xnRr8=" -> "32Qs/LyeguumUw38x72vZMAFMEDL3Z0a9lqv6O+o6oE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "/s+gA83DnAgzhpVlu4LkeGnPlLGGH3skxQHB5lM2/Bo=" -> "Q13elTm/1TF0S0Mp6q8IEJJRbqNgQAJPXBMhums9JEw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "aCmtwKuv5CnUAm+fr6GLcJMLjsgOSlEIxT8xobMNAUw=" -> "LeDDUgF2ZesGfQNzLkP8Ep1T7EMLI70bKsNQeCJjYWo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-07T19:02:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "TSj12fp06ujnAgMB8VODrORirMe4Y/3Rvd6Bl2JWHRA=" -> "IOhP0zzYhFCS0VSaicUrYKVkOnj+mxIL2re3ubB1ra0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "6qPuauwQy7mEuk7rxNKGm5eQW1ysR0Gm426WhKOz39A=" -> "o6kuSM4xDLtWKoeCguy+Che5fwZEWaLEkemV7BUrZWk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "jXL27f678LVKTCY/FkyGKjUjBayAK1S6bl+IKnuTNDg=" -> "ZygwowaIZOjxZbdPvuwYfeEx0p98vuIL5wOMUe53g4Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YA2Ldttnk21v6NaYOaRVmi1cFZDL4lbF53v/XBLU9so=" -> "bFexfrzxFujpcvuW0x+QtPn+2XLbEn8IucR1TLTGalY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "i6Y284eIOjf/kakPuxvPpL1nwqrry5qYnmapd1n5bBE=" -> "qBW0X0n7JoGfHU/7sAvdidL7JGoUsUXlJKy+c08lDNc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "5LtDCYQPOLxqt8NWFiwNgST/pn/QTkvP2Tq05JgjDbw=" -> "9ktQnc1rI0oko1VFgm/qi0tfLvjYEov94D1OqLQYJUE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "6SN/Ks2wG39i4GWwAyvbWiKBUnGtQqPJLE+CPOxK35k=" -> "cy2T1bbdoxBedjg3+2uG4MOO8acejOjjs3rPSTo6TrU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "6xHUmuMOMZhQdH0w7uuc8X2cm8YJx3VWDT9J2rWIo7g=" -> "DYkHhA2yE5Y+c87gb7C/W6GIwsd1JYSu5NLCtow5mg4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-07T19:03:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "4wCcTXyQzRDBLrwWFntfCy6ZYDplzV8bmGkLsuVLgaI=" -> "QlowZ3Nd1SMalDZes3Ch6/x46UYaWR2X4lhlv5UVEQc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-07T19:02:51Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "99awu9" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-07T19:02:51Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-07T19:02:50Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 87 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*